README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-02 lun 18:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6d7a3e4">1. Descargar JavaFX</a>
<ul>
<li><a href="#org399c2b6">1.1. En GNU/Linux</a></li>
<li><a href="#org19ed879">1.2. En Windows</a></li>
</ul>
</li>
<li><a href="#org1577067">2. Compilar aplicación</a>
<ul>
<li><a href="#org330b827">2.1. En GNU/Linux</a></li>
<li><a href="#org1692a3d">2.2. En Windows</a></li>
</ul>
</li>
<li><a href="#orge5d148a">3. Crear JAR</a>
<ul>
<li><a href="#org1e973db">3.1. GNU/Linux</a></li>
<li><a href="#org9151369">3.2. Windows</a></li>
</ul>
</li>
<li><a href="#org46f5898">4. Ejecutar</a></li>
<li><a href="#org07213e9">5. Crear ejecutable</a>
<ul>
<li><a href="#org642c22b">5.1. Para distros Debian (deb)</a></li>
<li><a href="#org7d2c84a">5.2. Para Windows</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org6d7a3e4" class="outline-2">
<h2 id="org6d7a3e4"><span class="section-number-2">1.</span> Descargar JavaFX</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org399c2b6" class="outline-3">
<h3 id="org399c2b6"><span class="section-number-3">1.1.</span> En GNU/Linux</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sh">$ wget https://download2.gluonhq.com/openjfx/21.0.10/openjfx-21.0.10_linux-x64_bin-sdk.zip
$ unzip openjfx-21.0.10_linux-x64_bin-sdk.zip -d javafx-sdk
</pre>
</div>
</div>
</div>
<div id="outline-container-org19ed879" class="outline-3">
<h3 id="org19ed879"><span class="section-number-3">1.2.</span> En Windows</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-sh">$ Invoke-WebRequest -Uri https://download2.gluonhq.com/openjfx/21.0.10/openjfx-21.0.10_windows-x64_bin-sdk.zip -OutFile openjfx.zip
$ Expand-Archive -Path openjfx.zip -DestinationPath javafx-sdk
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1577067" class="outline-2">
<h2 id="org1577067"><span class="section-number-2">2.</span> Compilar aplicación</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org330b827" class="outline-3">
<h3 id="org330b827"><span class="section-number-3">2.1.</span> En GNU/Linux</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-sh">$ javac --module-path &lt;path_to_javafx_lib&gt; --add-modules javafx.controls -d build/ src/dam/optativa/HelloWorldFx.java
</pre>
</div>
</div>
</div>
<div id="outline-container-org1692a3d" class="outline-3">
<h3 id="org1692a3d"><span class="section-number-3">2.2.</span> En Windows</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sh">$ javac --module-path javafx-sdk/javafx-sdk-21.0.10/lib --add-modules javafx.controls -d build/ src/dam/optativa/HelloWorldFx.java
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge5d148a" class="outline-2">
<h2 id="orge5d148a"><span class="section-number-2">3.</span> Crear JAR</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org1e973db" class="outline-3">
<h3 id="org1e973db"><span class="section-number-3">3.1.</span> GNU/Linux</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-sh">$ jar --create --file=build/HelloWorldFx.jar --manifest=manifest/MANIFEST.MF -C build/ .
</pre>
</div>
</div>
</div>
<div id="outline-container-org9151369" class="outline-3">
<h3 id="org9151369"><span class="section-number-3">3.2.</span> Windows</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-sh">$ jar --create --file=build/HelloWorldFx.jar --manifest=manifest/MANIFEST.MF -C build/ .
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org46f5898" class="outline-2">
<h2 id="org46f5898"><span class="section-number-2">4.</span> Ejecutar</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-sh">$ java --module-path javafx-sdk/javafx-sdk-21.0.10/lib --add-modules javafx.controls -jar build/HelloWorldFx.jar
</pre>
</div>
</div>
</div>
<div id="outline-container-org07213e9" class="outline-2">
<h2 id="org07213e9"><span class="section-number-2">5.</span> Crear ejecutable</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org642c22b" class="outline-3">
<h3 id="org642c22b"><span class="section-number-3">5.1.</span> Para distros Debian (deb)</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-sh">$ jpackage --input build/ <span style="color: #3548cf;">\</span>
    --name HelloWorldFx <span style="color: #3548cf;">\</span>
    --main-jar HelloWorldFx.jar <span style="color: #3548cf;">\</span>
    --main-class dam.optativa.HelloWorldFx <span style="color: #3548cf;">\</span>
    --type deb <span style="color: #3548cf;">\</span>
    --module-path path_to_javafx_lib --add-modules javafx.controls
</pre>
</div>
</div>
</div>
<div id="outline-container-org7d2c84a" class="outline-3">
<h3 id="org7d2c84a"><span class="section-number-3">5.2.</span> Para Windows</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-sh">$ jpackage --input build/ <span style="color: #8f0075; font-weight: bold;">`
          --name HelloWorldFx `</span>
          --main-jar HelloWorldFx.jar <span style="color: #8f0075; font-weight: bold;">`
          --main-class dam.optativa.HelloWorldFx `</span>
          --type exe <span style="color: #8f0075; font-weight: bold;">`
          --module-path javafx-sdk/javafx-sdk-21.0.10/lib `</span>
          --add-modules javafx.controls
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2026-02-02 lun 18:22</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
